Tekla Open API Reference for Tekla Structures 2025
PolyLine.Equals Method
 Returns true if the objects are equal.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Equals(
	Object O
)
Public Overrides Function Equals (
	O As Object
) As Boolean
Parameters
O
Type: System.Object
The object that equality is wished to be checked with.
Return Value
Type: Boolean
True if the objects are equal.
See Also
Reference
PolyLine Class
Tekla.Structures.Geometry3d Namespace